In [1]:
import pandas as pd

In [2]:
df1= pd.DataFrame({'A': [1,2,3],
                  'B':[10,20,30]})
df2= pd.DataFrame({'C': [4,5,6],
                  'D':[40,50,60]})

In [3]:
df1

   A   B
0  1  10
1  2  20
2  3  30

In [4]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [5]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [6]:
#other Paramater
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [7]:
df1= pd.DataFrame({'A': [1,2,3],
                  'B':[10,20,30]} , index =['a','b','c'])
df2= pd.DataFrame({'C': [4,5,6],
                  'D':[40,50,60]})

In [8]:
df1.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [9]:
#index must be same when we do join operation

In [9]:
df1= pd.DataFrame({'A': [1,2,3],
                  'B':[10,20,30]} , index =['a','b','c'])
df2= pd.DataFrame({'C': [4,5],
                  'D':[40,50]} , index =['a','b'])

In [10]:
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [15]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [16]:
#to handel this missing value will use HOW parameter

In [18]:
df1.join(df2 , how='right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [19]:
df1.join(df2 , how='inner') #inner means intersection

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [20]:
df1.join(df2 , how='outer') #outter means union

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [ ]:
#data fram with same column name

In [25]:
df1= pd.DataFrame({'A': [1,2,3],
                  'B':[10,20,30]} , index =['a','b','c'])
df2= pd.DataFrame({'A': [4,5],
                  'D':[40,50]} , index =['a','b'])

In [26]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['A'], dtype='object')

In [27]:
# so if we have same coumn name so will use suffix parameter

In [28]:
df1.join(df2 , lsuffix= '_1')

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [29]:
df1.join(df2 , rsuffix= '_1')

   A   B  A_1     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN